[
    {
      "name": "2022 Volkswagen Golf GTI",
      "description": "Overview\n\nThe Golf GTI epitomizes the idea of a hot hatch with snappy handling that makes twisting roads fun. A redesign this year improves power and refinement, making it one of the best all-around hatchbacks on the road. The Volkswagen Golf GTI is a 5-seater vehicle that comes in 3 trim levels. The most popular style is the 2.0T SE DSG, which starts at $36,525 and comes with a 2.0L I4 Turbo engine and Front Wheel Drive. This Golf GTI is estimated to deliver 25 MPG in the city and 34 MPG on the highway.\n\nPros\n\nSpirited acceleration\nResponsive handling\nGood cargo space\n\nCons\n\nTight rear seats\nNo all-wheel drive\n\nOverall Assessment\n\nThe Volkswagen Golf GTI is a performance hatchback that targets driving enthusiasts. It delivers strong acceleration and handling that's as engaging on the morning commute as on winding back roads. It has an attractive interior with quality details throughout. The top Autobahn trim delivers a true premium experience. Despite this little hatch's compact dimensions, it has a good amount of cargo room, making it a versatile choice. Although there's seating for five, the rear seats aren't particularly spacious; adult passengers won't be happy there for long.\n\nCompetitors include the Subaru WRX, a sporty hatchback with standard all-wheel drive so it's plenty capable when winter weather arrives. The Hyundai Veloster delivers more power than the GTI at a lower price across its lineup. The Honda Civic is available as a sedan or a hatchback that includes the performance-focused Type R, which boasts impressive horsepower.\n",
      "img": "https://static.tcimg.net/vehicles/primary/ef3f857d3d2ff525/2022-Volkswagen-Golf_GTI-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Hyundai Ioniq",
      "description": "Overview\n\nA solid, down-the-middle hybrid, also available as a plug-in version, the Hyundai Ioniq checks all the requisite fuel-sipper boxes: aerodynamic styling, plenty of standard features, nearly 60-mpg fuel economy, and a starting price of less than $25,000. It lacks some of the refinement of its main rivals, but it's still a comfortable, efficient commuter. The Hyundai Ioniq is a 5-seater vehicle that comes in 7 trim levels. The most popular style is the Hybrid SE, which starts at $26,645 and comes with a Hybrid 1.6L I4 engine and Front Wheel Drive. This Ioniq is estimated to deliver 54 MPG in the city and 57 MPG on the highway.\n\nPros\n\nStandard hybrid and plug-in hybrid options\nExcellent fuel economy\nLong warranty\n\nCons\n\nLess-than-urgent acceleration\nMediocre seats\n\nOverall Assessment\n\nWith four doors, ample cargo space, and room for five, the 2022 Ioniq is Hyundai's answer to the Toyota Prius. Like its liftback rival, the Ioniq is available as a standard gas-electric hybrid or a plug-in hybrid, which adds a rechargeable battery pack for extended electric-only operation.\n\nTrue to Hyundai's ethos, the Ioniq offers plenty of features at a lower cost than its competitors. Dual automatic climate control, an 8-inch touchscreen, Apple CarPlay and Android Auto, and driver aids such as forward-collision warning, automatic emergency braking, and lane-keeping assist are among the standard items on the Blue base model.\n\nAs a hybrid commuter, the Ioniq is a compelling pick. Rated at 59 mpg city/highway combined in the Blue trim, it's possible to make an average round-trip to the office on a single gallon of gas (as always, your mileage may vary). The cabin is quiet, the ride is cushy and composed, and the hatch area provides plenty of cargo space. Road trips are efficient, thanks to a 60-mpg highway rating, but you'll want to keep them infrequent. The Ioniq's thoughtful, comfortable cabin doesn't extend to the seats, which are fine for short trips but grow stiff and shapeless on longer drives.\n\nThe Prius was the original mass-appeal hybrid, and it still casts a long shadow over today's crop. It's also available in standard and plug-in versions, but unlike the Ioniq, it offers optional all-wheel drive. Some buyers will prefer the Ioniq's conventional design to the Prius' more flamboyant and futuristic lines. Other worthy alternatives include the pricier Honda Insight and, if you require all-wheel drive, the Subaru Crosstrek Hybrid and Kia Niro.\n",
      "img": "https://static.tcimg.net/vehicles/primary/497550910818aaf8/2022-Hyundai-Ioniq-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Honda Civic",
      "description": "Overview\n\nThe 2022 Honda Civic offers the latest remix of the ingredients that have made it one of America's most popular cars for decades. Nothing is startlingly new, but this Civic has enough improvements to give it an edge over the competition. The Honda Civic is a 5-seater vehicle that comes in 7 trim levels. The most popular style is the Sport Hatchback CVT, which starts at $25,845 and comes with a 2.0L I4 engine and Front Wheel Drive. This Civic is estimated to deliver 29 MPG in the city and 37 MPG on the highway.\n\nPros\n\nStrong and efficient engines\nFun-to-drive character\nUpscale interior\n\nCons\n\nNo hybrid model\nHatchback models will arrive later\n\nOverall Assessment\n\nThe Honda Civic has been one of America's best-selling vehicles for years. It checks all the important boxes — economy, reliability, comfort, safety — that buyers want in a compact car. And the special sauce is the Civic's fun-to-drive nature. From the bottom of the lineup on up, the Civic can put a smile on your face simply by the way it drives. And that's a claim few others in the segment can make.\n\nFor years compact sedans and hatchbacks have been getting bigger, but the new-for-2022 Civic doesn't stretch the envelope much. It's less than 2 inches longer than the previous generation and it is exactly the same height. Those seem to be the right dimensions because most compact cars mimic them almost exactly. Key competitors in the segment include the Toyota Corolla, Nissan Sentra, and Hyundai Elantra. The Asian brands have been so successful, they now have no domestic competitors and only one from Europe: the Volkswagen Jetta. Like its challengers, the Civic will seat five adults but is more comfortable with just four on board. It is currently available as a sedan only, but hatchback and performance models are expected.\n",
      "img": "https://static.tcimg.net/vehicles/primary/9d75931d3b0442be/2022-Honda-Civic-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Toyota Prius Prime",
      "description": "Overview\n\nThe Toyota Prius Prime has suspension tuning that's more squishy than supple, and competing models have nicer-looking cabins. But this midsize plug-in hybrid is a winner when it comes to interior comfort and fuel economy. The Toyota Prius Prime is a 5-seater vehicle that comes in 3 trim levels. The most popular style is the XLE, which starts at $31,475 and comes with a Plug-In Hybrid 1.8L I4 engine and Front Wheel Drive. This Prius Prime is estimated to deliver 55 MPG in the city and 53 MPG on the highway.\n\nPros\n\nUltra-frugal fuel economy\nRoomy, accommodating seats\nExtensive range of standard features\n\nCons\n\nMushy ride quality\nLess cargo room than a standard Prius\nRival models have more upscale cabins\n\nOverall Assessment\n\nAs you'd expect from a vehicle bearing the Prius badge, the Toyota Prius Prime is a whiz at delivering outstanding gas mileage; it's more fuel-efficient than rivals like the Kia Niro Plug-In Hybrid. In addition, its roomy seats make the cabin a comfortable place, and all models come with standard features (like heated front seats) that support a pleasant driving experience.\n\nOn a less impressive note, the Prius Prime's isolated, overly soft ride quality isn't likely to get you revved up about your commute. And from an aesthetic perspective, the pedestrian-looking cabin is a downgrade relative to the car's rivals. Still, it's easy to see the appeal of a car that's this fuel-efficient and feature-packed. Overall, the Prius Prime is a practical choice if you're looking for versatile transportation that won't dent your wallet at the gas pump.\n",
      "img": "https://static.tcimg.net/vehicles/primary/c6c4e750b3ec5c0d/2022-Toyota-Prius_Prime-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2023 Acura Integra",
      "description": "Overview\n\nThe Acura Integra returns to the lineup with a 200-horsepower turbo engine and well-balanced, fun-to-drive chassis. It is the only compact premium car with a versatile liftback body style and engaging six-speed manual transmission. The Acura Integra is a 5-seater vehicle that comes in 3 trim levels. The most popular style is the A-Spec Technology Package Manual, which starts at $36,895 and comes with a 1.5L I4 Turbo engine and Front Wheel Drive. This Integra is estimated to deliver 26 MPG in the city and 36 MPG on the highway.\n\nPros\n\nAffordable and fun to drive\nRoomy cabin with hatchback versatility\nAvailable six-speed manual transmission\n\nCons\n\nElevated road noise\nNo rear-seat air vents\nManual transmission only available on most expensive trim\nOverall Assessment\nBased on the same architecture that underpins the Honda Civic Si, the 2023 Acura Integra revives an epic moniker from the brand's earliest years. The all-new Integra's handsome exterior aligns with the larger Acura TLX sedan, and its spacious cabin provides more rear-seat space than the Audi A3 or Mercedes-Benz CLA 250. The Integra rolls with an eager 200-horsepower 1.5-liter engine and responsive, fun-to-drive chassis. And it offers a pair of features not found in the A3 sedan or CLA 250 four-door coupe: a liftback body with 24.3 cubic-foot of cargo space and an engaging, six-speed manual transmission.",
      "img": "https://static.tcimg.net/vehicles/primary/1afe22beace5ed95/2023-Acura-Integra-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Volkswagen Arteon",
      "description": "Overview\n\nA sleek and spacious sedan, the Volkswagen Arteon straddles the line between practicality and luxury. If you want a car that looks expensive and don't need the performance of a true luxury sedan, the Arteon is a satisfying choice. The Volkswagen Arteon is a 5-seater vehicle that comes in 3 trim levels. The most popular style is the SEL R-Line 4MOTION, which starts at $46,845 and comes with a 2.0L I4 Turbo engine and All Wheel Drive. This Arteon is estimated to deliver 22 MPG in the city and 30 MPG on the highway.\n\nPros\n\nCoupe styling with sedan practicality\nSurprising amount of passenger room\nAvailable all-wheel drive\n\nCons\n\nCabin doesn't look as impressive as the exterior\nNot particularly fun to drive\nOverall Assessment\nThe flagship of Volkswagen's sedan lineup, the Arteon is a gracefully styled four-door that looks more like a low-slung coupe. Don't let the looks deceive you, however, as the Arteon is a surprisingly spacious car that comfortably accommodates four adults. It has a hatchback design instead of trunk, so there's plenty of easily accessible cargo space. Like most Volkswagen sedans, the Arteon has a refined, sporty feel thanks to a firm suspension and precise steering. It's no sport sedan, but it's not a cushy cruiser either. The 2022 Arteon gets a new 300-horsepower engine and seven-speed automatic transmission. Front-wheel drive is standard, and all-wheel drive is optional. The interior is well built and attractive, but the materials are not quite up to luxury-brand standards. The touchscreen interface is small compared to rivals' larger, easy-to-read displays. There aren't many direct competitors in this category anymore, but the Acura TLX is worth a look, as well as the Genesis G70.",
      "img": "https://static.tcimg.net/vehicles/primary/de3d5b3c0506f58f/2022-Volkswagen-Arteon-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Mazda Mazda3",
      "description": "Overview\n\nBeautiful interior materials and powerful engine options make the Mazda3 stand out from the competition. The exterior displays elegant, refined styling, but pricing is on the high side for top trims. The Mazda Mazda3 is a 5-seater vehicle that comes in 8 trim levels. The most popular style is the Preferred Hatchback Automatic FWD, which starts at $27,115 and comes with a 2.5L I4 engine and Front Wheel Drive. This Mazda3 is estimated to deliver 26 MPG in the city and 34 MPG on the highway.\n\nPros\n\nHigh-quality interior trims\nExceptional driving dynamics\n\nCons\n\nPriced high for the segment\nInfotainment system is not intuitive\n\nOverall Assessment\n\nThe Mazda Mazda3 is easily one of the most fun compact cars you can drive. There's a choice of sedan or hatchback with a range of three responsive engines. There are all-wheel-drive choices for those who live in more wintry climates. All those possible configurations make it easy to find a version of the Mazda3 that suits your needs. Its sharp handling is paired with a smooth, quiet ride and a comfortable interior that surrounds passengers in high-quality trims. Though Mazda isn't a luxury brand, its top models often push into luxury territory. Our biggest gripe with this fun little car is the infotainment system. It features a rotary controller with no touchscreen; it takes a bit of time to get used to and is a challenge for passengers.\n\nThe Honda Civic has fewer trims and a less upscale interior, but is similarly fun to drive and costs less. The Toyota Corolla nine-trim range includes a hybrid and more affordable pricing. The Subaru Impreza has only four trims with lower pricing but doesn't boast the same smooth ride or elegant interior.\n",
      "img": "https://static.tcimg.net/vehicles/primary/9adc8e50714d5cf0/2022-Mazda-Mazda3-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Toyota Corolla Hatchback",
      "description": "Overview\n\nThe compact Toyota Corolla Hatchback features sporty styling, great handling, and a wide range of standard safety features. Its cargo area is more versatile than the [Toyota Corolla](/toyota/corolla/) sedan's, but its smaller backseat is short on legroom. The Toyota Corolla Hatchback is a 5-seater vehicle that comes in 3 trim levels. The most popular style is the SE CVT, which starts at $23,290 and comes with a 2.0L I4 engine and Front Wheel Drive. This Corolla Hatchback is estimated to deliver 32 MPG in the city and 41 MPG on the highway.\n\nPros\n\nSporty styling\nGood safety ratings\nSmooth ride\n\nCons\n\nTight rear legroom\nSmall trim range\n\nOverall Assessment\n\nThe Corolla Hatchback is the sportier counterpart to the Toyota Corolla sedan, which has more passenger room and an optional hybrid model. The hatchback's interior is comfortable and quiet with supportive front seats, but the rear seats are short on legroom. On the plus side, the hatchback's cargo area is much more versatile and can carry bulky items that won't fit in a traditional trunk. The Corolla Hatchback is powered by a responsive 2.0-liter four-cylinder engine with the option for a manual transmission. Toyota Safety Sense 2.0 provides a wide range of safety features, including automatic emergency braking. There's also a standard 8-inch infotainment touchscreen with Apple CarPlay and Android Auto. Add in its affordable starting price, and the Toyota Corolla Hatchback has strong appeal.\n\nThe higher priced Honda Civic is available as a hatchback with a wider range of trims and better rear passenger room. The Mazda3 has comparable pricing with a sleek, upscale interior. Finally, the Volkswagen Golf GTI offers stronger performance, better handling, and an eye-catching interior, but at a much higher starting price.\n",
      "img": "https://static.tcimg.net/vehicles/primary/e74b1a7ebc05ff0a/2022-Toyota-Corolla_Hatchback-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Toyota Prius",
      "description": "Overview\n\nThe five-passenger Toyota Prius hybrid is well-known for its excellent fuel economy, but it's no longer the most fuel-efficient hybrid in its segment. It has ample standard safety features and it offers all-wheel drive on select trims, but it's not engaging to drive. The Toyota Prius is a 5-seater vehicle that comes in 5 trim levels. The most popular style is the LE FWD, which starts at $27,310 and comes with a Hybrid 1.8L I4 engine and Front Wheel Drive. This Prius is estimated to deliver 54 MPG in the city and 50 MPG on the highway.\n\nPros\n\nGreat fuel efficiency\nOptional all-wheel drive\nExtensive standard safety\n\nCons\n\nQuirky design\nUninspired handling\nMediocre acceleration\nOverall Assessment\nThe Toyota Prius is perhaps the most recognizable hybrid out there, but its wedge-shaped design isn't for everyone. Embrace the quirkiness and you'll find the Prius holds an impressive amount of cargo. Its wide rear opening also lets you stow large items that other hatchbacks simply cannot manage. It provides a smooth ride for up to five passengers in a comfortable though modest interior. Four trims and the option for all-wheel drive make it easy to find a version of the Prius that suits your budget and your needs. And with a wide range of safety features standard across the lineup, you don't need a higher trim to get key features. Standard infotainment includes a large screen and smartphone connectivity with a tablet-sized available touchscreen on the top trim. The Honda Insight has just two trims with a more powerful engine and a higher starting price. The Kia Niro and Hyundai Ioniq both have more powerful engines, and the Ioniq starts at a lower price. None offer the option for all-wheel drive.",
      "img": "https://static.tcimg.net/vehicles/primary/28df7974448b9812/2022-Toyota-Prius-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2023 Kia Soul",
      "description": "Overview\n\nThe 2023 Kia Soul is a funky, fun-to-drive compact hatchback that looks and rides better than most small cars. It's as practical as can be, with a large cargo capacity, excellent warranty coverage, and good gas mileage. The Kia Soul is a 5-seater vehicle that comes in 4 trim levels. The most popular style is the GT-Line IVT, which starts at $24,685 and comes with a 2.0L I4 engine and Front Wheel Drive. This Soul is estimated to deliver 28 MPG in the city and 33 MPG on the highway.\n\nPros\n\nCharismatic design. Great features for the price. Long warranty. Sporty handling.\n\nCons\n\nNo hybrid available. Not much safety tech on the base trim.\nOverall Assessment\nShoppers looking for a small, affordable car that isn't tiring to live with will love the Kia Soul. Spunky, sporty, and spacious, the little hatchback has the essential things shoppers want in a small car. It doesn't offer a hybrid engine, but the 4-cylinder gas motor is efficient and surprisingly powerful. The Soul's lengthy warranty coverage provides extra peace of mind. Versatile and fun, the Kia Soul works great as a starter vehicle for college students, a daily driver, and a city car that stands out from the pack.",
      "img": "https://static.tcimg.net/vehicles/primary/7d319d938d7246a8/2023-Kia-Soul-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2023 Kia Stinger",
      "description": "Overview\n\nThe 2023 Kia Stinger is the flagship sedan from the South Korean automaker, dishing out a luxury-sport experience at a fraction of the price of the Europeans. It's a capable commuter, too, with a hatchback, 14 standard driver-assistance aids, and available all-wheel drive. The GT2 model with its turbocharged engine can sprint from 0-60 mph in 4.7 seconds, a number that should make pricier sedans sweat. The Kia Stinger is a 5-seater vehicle that comes in 2 trim levels. The most popular style is the GT2 RWD, which starts at $52,935 and comes with a 3.3L V6 Turbo engine and Rear Wheel Drive. This Stinger is estimated to deliver 18 MPG in the city and 25 MPG on the highway.\n\nPros\n\nImpressive driving capabilities. One of the better values on the market. Hatchback practicality.\n\nCons\n\nNot many options for personalization. No hybrid available. Ready for a redesign.\nOverall Assessment\nThe 2023 Kia Stinger offers excellent value, a lengthy warranty, a hatchback cargo area, and agile and fun driving dynamics. Some cabin materials are not as premium as European rivals, and Kia doesn't offer many options for personalization. Overall, the Stinger may surprise even the most jaded enthusiast, offering much of the performance of more expensive cars in a convenient, well-equipped package that's backed by Kia's long warranty.",
      "img": "https://static.tcimg.net/vehicles/primary/15da4672def20a68/2023-Kia-Stinger-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Audi A5",
      "description": "Overview\n\nThree stunning shapes — coupe, convertible, and hatchback — combined with sharp handling and advanced tech make the Audi A5 one of today's best compact sports cars. The Audi A5 is a 5-seater vehicle that comes in 3 trim levels. The most popular style is the S line Premium Plus Sportback 45 TFSI, which starts at $51,995 and comes with a 2.0L I4 Turbo engine and All Wheel Drive. This A5 is estimated to deliver 24 MPG in the city and 31 MPG on the highway.\n\nPros\n\nSporty handling and performance, boosted by standard all-wheel drive\nPremium interior materials\nThree body styles to suit most lifestyles\n\nCons\n\nSome competitors offer more rear passenger room\nScant cargo space in coupe and convertible models\nHefty premium for optional safety features\n\nOverall Assessment\n\nWith high-riding SUVs all the rage these days, Audi is one of the few automakers still in the coupe and convertible game. The 2022 Audi A5 blends the brand's trademarks — style, all-wheel-drive handling, technology — into stunning coupe, convertible, and four-door \"coupe\" shapes. Impeccable cabin design and materials infuse the interior with a luxury feel. Tech and infotainment are rich and full-featured, and while power is modest, the way the A5 slices through turns is joyous.\n\nFor 2022, the A5 adds a handful of upgrades. Android Auto, like Apple CarPlay, is now wireless, freeing the center console of cable spaghetti. A now-standard sport suspension sharpens handling for the coupe and Sportback hatch models. The popular Black Optic Plus appearance package is now available for the base Sportback.\n\nAudi isn't the only brand still bullish on coupes and convertibles, of course. Safe to say that if rivals such as BMW, Mercedes-Benz, and Lexus were not also still invested in two-doors and droptops, Audi's boardroom discussions might find renewed focus. But for now, the A5 remains one of the most refreshing alternatives to boxy sedans, sleepy SUVs, and Jeep-y safari cars.\n",
      "img": "https://static.tcimg.net/vehicles/primary/ee2f36ff8b612f5c/2022-Audi-A5-white-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Chevrolet Bolt EV",
      "description": "Overview\n\nRedesigned for 2022, the Chevrolet Bolt EV is now a top-tier EV. A reduced price, class-leading range, and fun driving dynamics make it one of the most affordable and enjoyable electric vehicles on the road. The Chevrolet Bolt EV is a 5-seater vehicle that comes in 2 trim levels. The most popular style is the 1LT, which starts at $32,495 and comes with an Electric engine and Front Wheel Drive. This Bolt EV is estimated to deliver 131 MPGe in the city and 109 MPGe on the highway.\n\nPros\n\nPlenty of range\nRoomy cabin\nSignificantly lower pricing\n\nCons\n\nStiff ride\nCramped rear legroom for taller passengers\nOverall Assessment\nThe Bolt was General Motors' first modern, mass-produced EV when it debuted as a 2017 model, and generally, it has been a great commuter car. With a mild exterior redesign and a major revamping of its interior, the 2022 Bolt EV should no longer be relegated to second-car status. Although still not as svelte and upscale as some newer EVs, it has become a small, comfortable, peppy, and affordable EV that can satisfy many needs.",
      "img": "https://static.tcimg.net/vehicles/primary/c8b72faf7f9cb2b9/2022-Chevrolet-Bolt_EV-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Mercedes-Benz EQS",
      "description": "Overview\n\nThe all-new 516-horsepower Mercedes EQS electric sedan impresses with a limousine-like cabin in a modern, aerodynamic five-seat package that provides up to 350 miles of electric driving range. The Mercedes-Benz EQS is a 5-seater vehicle that comes in 3 trim levels. The most popular style is the EQS 450+ RWD, which starts at $103,360 and comes with an Electric engine and Rear Wheel Drive. This EQS is estimated to deliver 97 MPGe in the city and 97 MPGe on the highway.\n\nPros\n\nRoomy, hushed, luxurious interior\nExhilarating acceleration with 516-hp EQS 580 model\nAvailable door-to-door Hyperscreen\n\nCons\n\nLess driving range than Lucid Air or Tesla Model S\nHyperscreen reflections distracting in bright sunlight\n\nOverall Assessment\n\nThe 2022 Mercedes-Benz EQS is the first to wear the Mercedes-EQ badge. By leading the electric charge with an S-Class-worthy luxury five-seater, the long-running German automaker is showing just how serious it is about electrifying its products in the coming years.\n\nThe 2022 EQS has a presence that won't be ignored, from the aerodynamic shape and long wheelbase to the radically different cab-forward profile, hidden hatchback, and extra-large rear seat. The 329-horsepower EQS 450+ is a first-rate premium electric sedan, but the EQS 580 with 516 zippy horsepower, added 4matic all-wheel drive, and best of all, the 56-inch-wide Hyperscreen dash display is the one that you just have to experience. The battery-electric EQS sedan brings true luxury and craftsmanship as well as leading-edge technology to the premium EV space.\n",
      "img": "https://static.tcimg.net/vehicles/primary/5b0b0815da325f26/2022-Mercedes-Benz-EQS-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Hyundai Veloster",
      "description": "Overview\n\nWith a powerful engine and sharp handling, this funky, three-door compact hatchback is ideal for city driving or blazing out of town. The low-rent interior is disappointing, but the Hyundai Veloster still offers excellent features and performance for the money. The Hyundai Veloster is a 4-seater vehicle that comes in 1 trim levels. The most popular style is the N DCT, which starts at $35,095 and comes with a 2.0L I4 Turbo engine and Front Wheel Drive. This Veloster is estimated to deliver 20 MPG in the city and 27 MPG on the highway.\n\nPros\n\nPowerful turbocharged engine\nSharp and engaging handling\nGreat performance value\n\nCons\n\nInterior quality doesn't match the sticker price\nRear seats are snug\nLess fuel-efficient than competitors\n\nOverall Assessment\n\nThe Hyundai Veloster N is a quirky compact hatchback with plenty of power to match its personality. A tidy footprint makes it a smart pick for city drivers, and its hatch area offers just enough room for luggage and everyday cargo needs. You'll love or loathe its styling, with its exaggerated rear end, dual center exhaust pipes, and fender creases, but it's not dull. While the Veloster N is nominally a four-seater, no one will want to ride in back for more than short dashes across town. This is a car geared toward solo drivers and couples.\n\nWith a 275-horsepower turbocharged engine, the Veloster N is more powerful than the few rivals in its price bracket, and it can pair with a manual or dual-clutch automatic transmission. An adaptive suspension and Pirelli summer tires also make the Hyundai a precise handler. You'd need to step up to the top-performance versions of its competitors to beat the Veloster's spec sheet.\n\nBut of course, the spec sheet doesn't tell all. The Veloster N falls short of its peers with middling fuel economy and an interior that feels more budget rental than a $30,000 hot hatch. Neither is a deal-breaker, but they're still disappointing. You'll pay more for a comparably equipped Volkswagen Golf GTI, which delivers a more refined interior, but much less power. The same goes for the Honda Civic Si, which closes the price gap and offers more space and a nicer cabin, but tops out at 200 hp.\n",
      "img": "https://static.tcimg.net/vehicles/primary/3edae6d233a8ce66/2022-Hyundai-Veloster-white-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Subaru Impreza",
      "description": "Overview\n\nThe 2022 Subaru Impreza hangs its hat on all-wheel drive and standard safety features. Other compacts are more fun to drive, but if you seek safety above all, the Impreza is an excellent pick. The Subaru Impreza is a 5-seater vehicle that comes in 4 trim levels. The most popular style is the Premium 5-door CVT, which starts at $24,190 and comes with a 2.0L H4 engine and All Wheel Drive. This Impreza is estimated to deliver 28 MPG in the city and 36 MPG on the highway.\n\nPros\n\nStandard all-wheel-drive\nProven powertrains\nGood standard driver-assist technologies\n\nCons\n\nNo hybrid option\nLackluster acceleration\n\nOverall Assessment\n\nSubaru has built a strong reputation on safety, and that's exactly what the 2022 Subaru Impreza represents. While others in the segment might offer more style, verve, and sheer driving enjoyment, the Impreza is a solid choice. Standard all-wheel drive gives it good all-weather traction, and its array of driver aids is impressive.\n\nAvailable in both sedan and hatchback models, the Impreza seats five adults, although four will be more comfortable. The sedan version is essentially the same length as the Nissan Sentra, Kia Forte, and Toyota Corolla. It also competes with the all-new 2022 Honda Civic and the Hyundai Elantra. The Volkswagen Jetta and Volkswagen Golf are the only European brand competitors in the compact segment.\n",
      "img": "https://static.tcimg.net/vehicles/primary/7d71f692bcbccb09/2022-Subaru-Impreza-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Kia Rio",
      "description": "Overview\n\nLow-priced cars are getting harder and harder to find, but the Kia Rio remains an excellent value. It provides good fuel efficiency, notable safety tech, and one of the best warranties available. The Kia Rio is a 5-seater vehicle that comes in 2 trim levels. The most popular style is the S 5-Door IVT, which starts at $18,485 and comes with a 1.6L I4 engine and Front Wheel Drive. This Rio is estimated to deliver 33 MPG in the city and 41 MPG on the highway.\n\nPros\n\nExcellent build quality\nComfortable ride\nLong list of available driver-assist features\n\nCons\n\nLimited cargo space\nMediocre acceleration\n\nOverall Assessment\n\nLow-priced sedans and hatchbacks usually require buyers to make some sacrifices, but the Kia Rio exceeds expectations. While neither sporty nor luxurious, it offers solid, comfortable, and reliable transportation for as many as five passengers. Available in four-door sedan and five-door hatchback versions, the Rio offers many creature comforts, a good balance between a cushy ride and sharp handling, and an impressive roster of available driver-assist and safety features. With its low purchase price and excellent fuel economy, it's not difficult to see why the Rio continues to be a favorite in its class.\n\nSize-wise, the Rio falls in the middle of the category. The sedan is the same length as the Hyundai Accent. It's 3 inches longer than the Mitsubishi Mirage, and 4 inches shorter than the Nissan Versa. Both sedan and hatchback versions of the Rio are technically five-seaters but two adults will fit more comfortably in the rear seat.\n",
      "img": "https://static.tcimg.net/vehicles/primary/6024509ebe72380b/2022-Kia-Rio-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Tesla Model S",
      "description": "Overview\n\nThe Tesla Model S continues its reign as the top luxury EV sedan by offering segment-leading range, performance, and tech, but it falls short of rivals in interior comfort and exterior styling. The Tesla Model S is a 5-seater vehicle that comes in 2 trim levels. The most popular style is the Plaid, which starts at $137,190 and comes with an Electric engine and All Wheel Drive. This Model S is estimated to deliver 119 MPGe in the city and 112 MPGe on the highway.\n\nPros\n\nClass-leading driving range\nSeat-pinning performance\nTesla brand cachet\n\nCons\n\nDated exterior styling\nInterior materials aren't as high-quality as its rivals\nLacks Apple CarPlay and Android Auto\n\nOverall Assessment\n\nWith the volume and variety of Tesla vehicles now swarming roads in certain parts of the country (we're looking at you, California), it is easy to forget the Model S is the car that made EVs practical and desirable — and Elon Musk a household name. Tesla being Tesla, the company doesn't follow the traditional redesign/refresh cadence of most automakers, but a de facto 2021 model year refresh tweaked the aging exterior design of the Model S, added a new horizontally oriented infotainment screen in the dash and a small screen for rear-seat passengers, and introduced a controversial steering yoke.\n\nThe 2022 Model S still doesn't include Apple CarPlay and Android Auto smartphone integration, and its cabin is spartan compared to new EV competitors such as the Mercedes-Benz EQS and Porsche Taycan that offer more luxurious and updated interiors. But with its long range (and extensive Tesla's Supercharger network), generous cargo space, and first-class technology, the Model S in many ways still rules the luxe EV sedan roost.\n",
      "img": "https://static.tcimg.net/vehicles/primary/8b0cbf62d6c77aad/2022-Tesla-Model_S-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Nissan LEAF",
      "description": "Overview\n\nThe Nissan Leaf is a small electric car with an affordable price that eases the switch to electric. Its shorter-than-average range is its biggest downside, but the Leaf Plus trim addresses that, if you're willing to spend a bit more. The Nissan LEAF is a 5-seater vehicle that comes in 5 trim levels. The most popular style is the SV, which starts at $29,895 and comes with an Electric engine and Front Wheel Drive. This LEAF is estimated to deliver 123 MPGe in the city and 99 MPGe on the highway.\n\nPros\n\nRoomy cabin\nSolid list of driver-assist features\nPriced lower than many rivals\n\nCons\n\nRear seats do not fold down flat\nRange and power for base trims lags competitors\nOverall Assessment\nThe Nissan Leaf is now in its 12th year of production. While Nissan might not be the first name that comes to mind when you think of electric vehicles, the Leaf was on the road well before the current crop of crossovers and hatchbacks. Unfortunately, updates have been few and far between, so it now lags the competition in several ways. Where it excels is in its value. It offers great standard equipment for the price and is a bargain compared to the Chevrolet Bolt, Kia Niro, Hyundai Kona Electric, and more upscale Tesla Model 3. However, it doesn't have the range of those cars in its base trim. You have to pay more for the Leaf Plus if you want longer range, but even then, only the base trim of the Ford Mustang Mach-E is more affordable. Another plus is the Leaf's surprisingly roomy cargo area, but be aware that its rear seats do not fold flat.",
      "img": "https://static.tcimg.net/vehicles/primary/910bc7aa1c799a02/2022-Nissan-LEAF-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Audi S7",
      "description": "Overview\n\nWith crisp acceleration, loads of cargo space, and commuter-friendly handling, the Audi S7 is easy to live with and fun to drive. But rival models offer more rear headroom and more horsepower. The Audi S7 is a 5-seater vehicle that comes in 2 trim levels. The most popular style is the Prestige, which starts at $91,595 and comes with a 2.9L V6 S/C and Turbo engine and All Wheel Drive. This S7 is estimated to deliver 18 MPG in the city and 28 MPG on the highway.\n\nPros\n\nSporty, yet comfortable handling\nStunning design inside and out\nLots of cargo space\n\nCons\n\nLimited rear headroom\nLess horsepower than some rivals\n\nOverall Assessment\n\nThe Audi A7 is a midsize luxury sedan that rates highly for style and utility. The S7 shares a platform with that car, adding high-performance upgrades such as a more potent engine and larger wheels with summer tires. Its eager acceleration and smooth handling brighten daily commutes. Also, there's ample room for cargo. The S7 has more cargo capacity than its Mercedes-Benz CLS rival. And this Audi makes a striking visual statement with its sculpted exterior and posh cabin.\n\nUnfortunately, the S7's coupe-like roofline limits headroom for those in the second row. Also, the competing BMW M5 surpasses the Audi performance sedan in horsepower. Still, with its chic styling and polished driving dynamics, the S7 is one of the most likable picks in a competitive class.\n",
      "img": "https://static.tcimg.net/vehicles/primary/def879293d338751/2021-Audi-S7-silver-full_color-driver_side_front_quarter.png"
    }
  ]