[
    {
      "name": "2022 Hyundai Sonata",
      "description": "Overview\n\nIt may not be quite as engaging to drive as the class-leading Honda Accord, but the Hyundai Sonata offers strong value in its segment with distinctive styling and upscale features. With an available gas-electric hybrid and the 290-horsepower N Line performance version, there's a Sonata for almost every buyer. The Hyundai Sonata is a 5-seater vehicle that comes in 9 trim levels. The most popular style is the SEL, which starts at $27,345 and comes with a 2.5L I4 engine and Front Wheel Drive. This Sonata is estimated to deliver 27 MPG in the city and 37 MPG on the highway.\n\nPros\n\nExcellent variety of offerings\nIntuitive tech features\nClass-leading warranty\n\nCons\n\nHigh-performance engine is limited to the pricey N Line trim\nRear seat isn't as spacious as some competitors\nOverall Assessment\nThe Hyundai Sonata, now in its second year after a complete redesign, continues to provide a compelling value proposition among midsize sedans. With attractive lines, excellent safety features, a well-appointed cabin, and a wide variety of powertrains — from conventional gasoline engines to a gas-electric hybrid — the Sonata offers performance and features on par with longtime standard-bearers in the class, such as the Toyota Camry and the Honda Accord, while undercutting them on price.",
      "img": "https://static.tcimg.net/vehicles/primary/76cb6e5606bbb528/2022-Hyundai-Sonata-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2023 Hyundai Elantra",
      "description": "Overview\n\nThe Hyundai Elantra maintains its strong standing among other compact sedans with a roomy interior, a long list of standard safety features, and a very generous warranty. There are also plenty of models available, from efficient hybrids to a high-performance variant. The Hyundai Elantra is a 5-seater vehicle that comes in 6 trim levels. The most popular style is the Hybrid Limited DCT, which starts at $30,095 and comes with a Hybrid 1.6L I4 engine and Front Wheel Drive. This Elantra is estimated to deliver 49 MPG in the city and 52 MPG on the highway.\n\nPros\n\nSpacious interior for the class\nComprehensive list of safety features\nIndustry-leading warranty\n\nCons\n\nAbundance of hard interior plastics\nBase engine is merely adequate\n\nOverall Assessment\n\nThe 2023 Hyundai Elantra stands out from other compact sedans with its sharply creased and faceted sheet metal as well as its broad grille with integrated wraparound headlights. But don't think that it's only about style, because it also has plenty of substance to prove its worth. In the Hyundai lineup, the Elantra fills the gap between the smaller Accent and midsize Sonata. Much like the larger Sonata, the Elantra is offered in several variants that include an affordable base trim, very efficient hybrids, and a sporty alternative. It goes one step further with a higher performance Elantra N model with 276 horsepower.\n\nCompared to other sedans in this class, such as the Honda Civic and Toyota Corolla, the Elantra further distinguishes itself with a spacious cabin, a lot of standard features for the money, and the longest warranty in the industry. Sadly, it's not offered in a sportier hatchback body style, but the 2023 Hyundai Elantra's many strengths more than make up for that.\n",
      "img": "https://static.tcimg.net/vehicles/primary/34a1eebc35abdeed/2023-Hyundai-Elantra-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2021 Karma GSe-6",
      "description": "Overview\n\nThe Karma GSe-6 rides the wave of eco-conscious luxury sedans, a particularly exotic plug-in hybrid crafted from sustainable materials in California. It offers up to 70 mpg from its gas engine and a further 80 miles of electric range. All that, and drivers get all the performance thrills that 536 horsepower can offer on its rear-wheel-drive platform. The GSe-6 has solar panels built into the roof to help replenish its electric range. The Karma GSe-6 is a 4-seater vehicle that comes in 3 trim levels. The most popular style is the Luxury, which starts at $95,700 and comes with a Plug-In Hybrid 1.5L I3 Turbo engine and Rear Wheel Drive. This GSe-6 is estimated to deliver 70 MPG combined.\n\nPros\n\nSlinky exterior styling. Handsomely equipped. Surprisingly quick.\n\nCons\n\nNot as refined as rivals. Still requires gas. Small trunk.\nOverall Assessment\nCrafted from environmentally sustainable materials and race-themed tech, the Karma GSe-6 is nothing if not unique and full of charisma. Its plug-in hybrid powertrain recharges quickly and offers stellar speed and stopping power. Factoring in its turbocharged engine-turned-generator, the Karma can match full-electric rivals for driving range, though it still requires a stop at the gas pump. The GSe-6 is still far more efficient than your average gas-powered luxury sedan. Cars like that don't come along every day, making the GSe-6 worth a test drive for the right customer.",
      "img": "https://static.tcimg.net/vehicles/primary/31e2c2796238ecb0/2021-Karma-GSe-6-white-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Honda Civic",
      "description": "Overview\n\nThe 2022 Honda Civic offers the latest remix of the ingredients that have made it one of America's most popular cars for decades. Nothing is startlingly new, but this Civic has enough improvements to give it an edge over the competition. The Honda Civic is a 5-seater vehicle that comes in 7 trim levels. The most popular style is the Sport Sedan CVT, which starts at $25,045 and comes with a 2.0L I4 engine and Front Wheel Drive. This Civic is estimated to deliver 30 MPG in the city and 37 MPG on the highway.\n\nPros\n\nStrong and efficient engines\nFun-to-drive character\nUpscale interior\n\nCons\n\nNo hybrid model\nHatchback models will arrive later\n\nOverall Assessment\n\nThe Honda Civic has been one of America's best-selling vehicles for years. It checks all the important boxes — economy, reliability, comfort, safety — that buyers want in a compact car. And the special sauce is the Civic's fun-to-drive nature. From the bottom of the lineup on up, the Civic can put a smile on your face simply by the way it drives. And that's a claim few others in the segment can make.\n\nFor years compact sedans and hatchbacks have been getting bigger, but the new-for-2022 Civic doesn't stretch the envelope much. It's less than 2 inches longer than the previous generation and it is exactly the same height. Those seem to be the right dimensions because most compact cars mimic them almost exactly. Key competitors in the segment include the Toyota Corolla, Nissan Sentra, and Hyundai Elantra. The Asian brands have been so successful, they now have no domestic competitors and only one from Europe: the Volkswagen Jetta. Like its challengers, the Civic will seat five adults but is more comfortable with just four on board. It is currently available as a sedan only, but hatchback and performance models are expected.\n",
      "img": "https://static.tcimg.net/vehicles/primary/0ea4a7bd313f2074/2022-Honda-Civic-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Audi A3",
      "description": "Overview\n\nThe 2022 Audi A3 is one of the most appealing small luxury cars on the market. It delivers a winning combination of good looks and impressive driving manners. The Audi A3 is a 5-seater vehicle that comes in 3 trim levels. The most popular style is the Premium quattro, which starts at $37,895 and comes with a 2.0L I4 Turbo engine and All Wheel Drive. This A3 is estimated to deliver 28 MPG in the city and 36 MPG on the highway.\n\nPros\n\nSophisticated design\nExcellent ride-handling combination\nImpressive powertrain\n\nCons\n\nLimited trunk space\nMany safety features are optional\n\nOverall Assessment\n\nFirst offered as a hatchback, the Audi A3 switched its emphasis to the sedan body style with the 2015 redesign. And the all-new 2022 version is being sold in the U.S. only in sedan form. For 2022, a turbocharged four-cylinder engine is the standard (and only) powerplant, now with mild-hybrid technology for added efficiency. The interior has a completely new look highlighted by the Audi Digital Cockpit, which puts maps and other information right in the driver's face. The infotainment screen is larger, too. Front seats are exceptionally comfortable yet supportive for spirited driving, and three adults fit comfortably in the rear. In all, the A3 has a near-perfect interior.\n\nThe Audi A3 is a couple of inches longer than its most direct competitor, the Mercedes-Benz A-Class. Other sedans that deliver similar vibes include the Alfa Romeo Guilia and Cadillac CT4.\n",
      "img": "https://static.tcimg.net/vehicles/primary/236d58fd5d4c57dc/2022-Audi-A3-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Honda Accord",
      "description": "Overview\n\nThe 2022 Accord scores a rare hat trick. It's not just a comfortable family hauler, it's also highly entertaining behind the wheel, and it boasts elegantly simple design inside and out. The Accord deserves a place on the list of anyone shopping for a midsize sedan. The Honda Accord is a 5-seater vehicle that comes in 9 trim levels. The most popular style is the Sport 1.5T CVT, which starts at $30,075 and comes with a 1.5L I4 Turbo engine and Front Wheel Drive. This Accord is estimated to deliver 29 MPG in the city and 35 MPG on the highway.\n\nPros\n\nA joy to drive\nPlenty of passenger and cargo space\nFuel-efficient — especially the available hybrid\n\nCons\n\nLacks all-wheel drive\nHigher trim levels can get expensive\nFinicky push-button gear selector\nOverall Assessment\nFor decades, the Honda Accord has enjoyed a deserved reputation for excellence. And the current version, which first appeared in 2018, is no different. In fact, we think it's better than ever. Some 8 inches longer than its compact sibling, the Honda Civic, the midsize Accord offers sleek styling as well as a spacious, well-appointed cabin with easy-to-use tech and one of the segment's roomiest trunks. But its strongest trait is only apparent once you take it for a spin. Despite its family-car roots, the Accord is truly fun to drive, thanks to a compelling combination of engaging handling, responsive performance, and comfortable ride. The base 1.5-liter engine offers plenty of pep — not to mention good fuel economy — while an optional turbocharged 2.0-liter ups the fun quotient considerably. A fuel-sipping hybrid version is also available. The Accord's ongoing excellence has inspired rivals, such as the Mazda Mazda6 and the Toyota Camry, to up their games, while newcomers, such as the Kia K5 and Hyundai Sonata, also offer strong competition. But the Accord remains the benchmark in this class.",
      "img": "https://static.tcimg.net/vehicles/primary/6616bfa4a25ad40e/2022-Honda-Accord-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Toyota Camry",
      "description": "Overview\n\nThe Toyota Camry is a fuel-efficient and roomy sedan that easily accommodates five adults. Its wide variety of trims range from luxurious to sporty. But the trunk is only average, and its base engine is underpowered. The Toyota Camry is a 5-seater vehicle that comes in 13 trim levels. The most popular style is the SE Automatic FWD, which starts at $28,410 and comes with a 2.5L I4 engine and Front Wheel Drive. This Camry is estimated to deliver 28 MPG in the city and 39 MPG on the highway.\n\nPros\n\nRoomy interior\nWide range of trim levels\nHybrid offers excellent mileage\n\nCons\n\nUnimpressive base engine\nAverage trunk space\n\nOverall Assessment\n\nThe 2022 Toyota Camry is a midsize sedan with plenty of room for five passengers. It has something for everyone with 13 trims that include two gas engines, a hybrid engine, and a choice of front-wheel or all-wheel drive. No matter which you choose, the Camry is focused on passenger comfort with a welcoming interior swathed in attractive materials throughout. While some sedans have minimal rear-seat room, the Camry can comfortably seat three adults back there. It boasts a wide range of standard safety features along with a comprehensive infotainment system. Downsides are an underpowered base engine and a small trunk that makes it difficult to accommodate luggage for those five adults.\n\nOther popular choices in the midsize-sedan segment include the Nissan Altima, Honda Accord, and Hyundai Sonata. The Altima has fewer trims with similar pricing and a less powerful engine. The Accord provides better fuel economy and more room for cargo. The Sonata has similar pricing and a lineup that includes both gas and hybrid engines.\n",
      "img": "https://static.tcimg.net/vehicles/primary/68605c4f2a147cf4/2022-Toyota-Camry-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Lexus ES",
      "description": "Overview\n\nSmooth-riding and exceptionally quiet, the Lexus ES midsize luxury sedan makes the daily commute feel relaxing. Its performance isn't exciting, but it's a top choice if you want a reliable, well-equipped, comfortable luxury sedan. The Lexus ES is a 5-seater vehicle that comes in 12 trim levels. The most popular style is the ES 350 FWD, which starts at $42,025 and comes with a 3.5L V6 engine and Front Wheel Drive. This ES is estimated to deliver 22 MPG in the city and 32 MPG on the highway.\n\nPros\n\nSerene cabin and comfortable ride\nHybrid model delivers impressive fuel economy\nAvailable all-wheel drive\n\nCons\n\nNot very exciting to drive, even with upgraded F Sport trim\nTrunk is on the small side\nAll-wheel drive is only available with a four-cylinder engine\n\nOverall Assessment\n\nAs SUVs continue to dominate the luxury market, sedans like the Lexus ES are becoming a rare breed. A true midsize sedan that can seat five comfortably, the ES leaves performance goals to its European competitors. This Lexus is designed for quiet comfort above all else. The spacious interior features top-quality materials and a user-friendly design; a new touchscreen infotainment screen rectifies a previous shortcoming. The popular V6 model offers strong acceleration and smooth shifts while the hybrid delivers impressive mileage. All-wheel drive is available for those who need all-weather traction, but it's paired with a less powerful four-cylinder engine.\n\nThe closest competitors to the Lexus ES are the Acura TLX and Genesis G80. The TLX is similar in size and price, but it has a sportier look and feel. The G80 matches the ES' luxury and passenger accommodations, but it doesn't offer a hybrid model.\n",
      "img": "https://static.tcimg.net/vehicles/primary/9d3162fa0de9392e/2022-Lexus-ES-white-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Honda Insight",
      "description": "Overview\n\nBasically, the Honda Insight is a Honda Civic Hybrid, and that's a good thing. This compact sedan offers a spacious interior, delivers incredible fuel economy, and is the most fun to drive of the hybrids in its price range. The Honda Insight is a 5-seater vehicle that comes in 2 trim levels. The most popular style is the EX, which starts at $26,855 and comes with a Hybrid 1.5L I4 engine and Front Wheel Drive. This Insight is estimated to deliver 55 MPG in the city and 49 MPG on the highway.\n\nPros\n\nExcellent fuel economy\nFun to drive\nRoomy interior\n\nCons\n\nInfotainment systems can be challenging to operate\nWould be more useful as a hatchback\nOverall Assessment\nThe 2022 Honda Insight is the most enjoyable-to-drive hybrid sedan in its class, which includes the Toyota Prius. Insight delivers about as much performance and overall verve as the extremely popular Honda Civic, and like the Civic, it will transport five passengers in comfort. The Insight also delivers incredible fuel economy. That's a nifty trick considering its character and performance. Rivals include the slightly shorter Toyota Corolla Hybrid and Prius, and the slightly longer Hyundai Elantra Hybrid. Fun, efficient, and spacious, the Insight is a wise buy for singles, couples, and even families with small children.",
      "img": "https://static.tcimg.net/vehicles/primary/856cc616dcb727f7/2022-Honda-Insight-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Toyota Avalon",
      "description": "Overview\n\nAimed squarely at traditional sedan buyers, the Toyota Avalon blends near luxury accommodations with a serene ride, surprising efficiency, and a spacious trunk. It's not nearly as sporty as its design implies, but buyers who prefer a smooth and quiet ride with a minimum of fuss will find plenty to like in the Avalon. The Toyota Avalon is a 5-seater vehicle that comes in 6 trim levels. The most popular style is the Limited FWD, which starts at $44,150 and comes with a 3.5L V6 engine and Front Wheel Drive. This Avalon is estimated to deliver 22 MPG in the city and 31 MPG on the highway.\n\nPros\n\nSeats five comfortably\nLong list of standard features\nQuiet cabin and supple suspension make it great for both commuting and long trips\n\nCons\n\nPerformance doesn't match its sporty styling\nUpper trim levels approach luxury-brand prices\nOverall Assessment\nThe Toyota Avalon is one of the few remaining full-size sedans on the market. Slightly larger than the midsize Toyota Camry, the Avalon has more than enough room to accommodate five adults. A long list of standard features makes for a comfortable cabin even on the base trim. The six trim levels offer everything from a Nightshade model with dark exterior accents to a Limited trim with a near luxury level of equipment. All Avalon models are front-wheel drive and feature suspensions that are designed to deliver a smooth, composed ride over any surface. Standard models get V6 power while the hybrid models combine a four-cylinder gas engine with electric motors for improved fuel efficiency. Performance takes a back seat to comfort on all Avalon models, so although there's plenty of power available it's always doled out in a smooth, unobtrusive manner. A spacious trunk and long list of standard safety features round out the Avalon's impressive résumé.",
      "img": "https://static.tcimg.net/vehicles/primary/db2ef472c9a9a672/2022-Toyota-Avalon-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Volkswagen Passat",
      "description": "Overview\n\nA classic family sedan, the Volkswagen Passat offers a spacious cabin, a smooth ride, and plenty of room in the trunk. Although some elements of the cabin design make it feel a bit dated, it's still a capable sedan worth considering. The Volkswagen Passat is a 5-seater vehicle that comes in 3 trim levels. The most popular style is the 2.0T Limited Edition, which starts at $31,570 and comes with a 2.0L I4 Turbo engine and Front Wheel Drive. This Passat is estimated to deliver 24 MPG in the city and 36 MPG on the highway.\n\nPros\n\nSpacious rear seat\nEasy-to-operate infotainment system\nSizable trunk\n\nCons\n\nComparable cars have higher-end interiors\nOnly one engine choice\n\nOverall Assessment\n\nWith SUVs dominating the family fleet, the audience for large sedans is secondary. But two strong motivations for sedan ownership are affordability and improved handling. For five decades, the Volkswagen Passat has been a strong seller due to German engineering and design aesthetics. However, popular Japanese manufacturers Honda and Toyota have always dominated the segment. Now the time has come for Volkswagen to retire its largest passenger car; 2022 will be the last model year for the Passat.\n\nBuyers can choose from either a Passat SE base model, the sporty Passat R-Line, or the newly packaged 2022 Passat Limited Edition — of which only 1,973 units are being made. That number is based on the year production at the Chattanooga, Tennessee, VW plant began.\n",
      "img": "https://static.tcimg.net/vehicles/primary/6d56d2cb2869fc26/2022-Volkswagen-Passat-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Volkswagen Jetta",
      "description": "Overview\n\nThe Volkswagen Jetta sedan delivers good bang for the buck for buyers looking for a fuel-efficient, fun-to-drive European driving experience. The Volkswagen Jetta is a 5-seater vehicle that comes in 5 trim levels. The most popular style is the SE Automatic, which starts at $25,190 and comes with a 1.5L I4 Turbo engine and Front Wheel Drive. This Jetta is estimated to deliver 29 MPG in the city and 40 MPG on the highway.\n\nPros\n\nAffordable driving fun\nRoomy cabin and trunk\nNew base 1\n5-liter is peppier, more fuel-efficient\n\nCons\n\nPlain styling\nSome low-quality interior trim bits\nNot all driver-assist features available on lower trim levels\n\nOverall Assessment\n\nAlthough Volkswagen is rapidly expanding its roster of crossover SUVs, it isn't moving entirely away from compact cars. The Jetta has been the German automaker's best-selling sedan for quite some time, and a mild refresh this year keeps it relevant.\n\nWhile the Jetta's boxy styling is no match for the eyeball-turning design of the Hyundai Elantra, its durable interior and front-wheel-drive layout make it a popular choice. It doesn't match the Mazda3's premium cabin and all-wheel-drive traction, and even with its new, thriftier 1.5-liter engine the Jetta is less fuel-efficient than the Toyota Corolla Hybrid. But the VW offers a European driving experience in an affordable small sedan.\n\nThe top-of-the-line 228-hp Jetta GLI continues to be a standout among compact performance sedans such as the Honda Civic Si, Hyundai Elantra N Line, and Subaru WRX.\n",
      "img": "https://static.tcimg.net/vehicles/primary/d41c2f66d7a9a4d6/2022-Volkswagen-Jetta-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Toyota Corolla",
      "description": "Overview\n\nThe Toyota Corolla has long been the go-to for reliable transportation at a low price, and the current version is no different. It offers lots of standard features, a comfortable interior, and great fuel efficiency, but it's not very fun to drive and cargo space is limited. The Toyota Corolla is a 5-seater vehicle that comes in 9 trim levels. The most popular style is the LE CVT, which starts at $21,900 and comes with a 1.8L I4 engine and Front Wheel Drive. This Corolla is estimated to deliver 30 MPG in the city and 38 MPG on the highway.\n\nPros\n\nExcellent fuel efficiency, including hybrid model\nSpacious interior\nWide array of standard safety features\n\nCons\n\nLimited cargo space\nNot as fun to drive as some competitors\nBuzzy engine\nOverall Assessment\nOne of the best-selling cars of all time, the Toyota Corolla has a reputation for excellent reliability. At the same time, it has recently broken out of its plain-jane shell to offer sports and appearance trims that give the venerable model new zest. It's also a beneficiary of Toyota's efforts to provide standard driver-assist systems. For the 2022 model, the Corolla is available as a four-door sedan or four-door hatchback. Last year a small crossover, the Corolla Cross, adopted the Corolla name, but that is reviewed separately. The sedan offers two gasoline engine choices plus a hybrid version. One of the smallest vehicles in the Toyota lineup, the Corolla fits above the hybrid-only Toyota Prius and below the midsize Toyota Camry. It competes head-to-head with the Nissan Sentra, Honda Civic, Hyundai Elantra, and several other models in one of the industry's largest segments.",
      "img": "https://static.tcimg.net/vehicles/primary/b3219f5c56ce136d/2022-Toyota-Corolla-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Volvo S60 Recharge",
      "description": "Overview\n\nAmple power, style, and luxury make the Volvo S60 Recharge an alternative to the usual European sedans. With a plug-in battery pack helping deliver 415-plus horsepower and 30 mpg, the S60 Recharge is a true unicorn. The Volvo S60 Recharge is a 5-seater vehicle that comes in 4 trim levels. The most popular style is the Inscription, which starts at $51,695 and comes with a Plug-In Hybrid 2.0L I4 S/C and Turbo engine and All Wheel Drive. This S60 Recharge is estimated to deliver 30 MPG combined.\n\nPros\n\nOutstanding cabin comfort and materials\nSwift acceleration\nInnovative safety features\n\nCons\n\nAwkward infotainment interface\nStiff and unnatural braking feel\nOptions add up to a pricey luxury compact\n\nOverall Assessment\n\nA left-field choice compared to European rivals, the Volvo S60 has quietly built a fanbase with crisp, modern design, interior refinement, and Volvo's dedication to innovative safety features. But the 2022 S60 Recharge stands nearly alone as the only compact luxury sedan available as a plug-in hybrid, offering all the regular model's premium and sporty goodness, but with a side of electric range and added power. The Recharge's only comparable competitor is the BMW 330e, which provides similar gas and electric efficiency, but with BMW's handling and performance abilities.\n\nThe S60 Recharge packs its own punch though, with substantial grip and lively handling afforded by its compact size and standard all-wheel drive. The high-performance Polestar trim delivers even more power and athleticism. The car's meager trunk space hinders utility, although this is endemic to the class; the BMW offers only a bit more cargo capacity. If you need more room, it's worth considering luxury plug-in crossovers such as the Audi Q5 and Lexus NX. The Mini Countryman Cooper SE ALL4 also deserves a mention, with estimated fuel economy of 29 mpg, although its range of 16 electric miles isn't too impressive given its price.\n",
      "img": "https://static.tcimg.net/vehicles/primary/43ae9af36675618f/2022-Volvo-S60_Recharge-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Subaru Legacy",
      "description": "Overview\n\nThe Subaru Legacy has a comfortable interior and a wide range of standard safety and tech features that make it a great choice for families. It is a good value among midsize sedans, especially in its lower trim levels. The Subaru Legacy is a 5-seater vehicle that comes in 6 trim levels. The most popular style is the 2.5i Limited, which starts at $31,440 and comes with a 2.5L H4 engine and All Wheel Drive. This Legacy is estimated to deliver 27 MPG in the city and 35 MPG on the highway.\n\nPros\n\nStandard all-wheel drive\nAffordable starting price\nRemarkably smooth ride\n\nCons\n\nUnimpressive fuel economy\nBland exterior styling\n\nOverall Assessment\n\nThe Subaru Legacy is a midsize sedan that offers a wide range of trims, a choice of two engines, and a long list of standard features. All Legacy models come with all-wheel drive, making them a favorite among drivers who live in snowy climates. The ride is impressively smooth and quiet, but this isn't a sporty car. Acceleration is modest, especially with the base four-cylinder engine. Still, the Legacy provides the comfort, features, and composed ride that families and commuters will appreciate.\n\nComparatively, the Honda Accord has a roomy interior, more trim levels, and a hybrid model, but no all-wheel drive. The Hyundai Sonata also has more trims but is available only with front-wheel drive. The Kia K5 is an all-new model with either front-wheel or all-wheel drive and sportier handling.\n",
      "img": "https://static.tcimg.net/vehicles/primary/9fe35dd3a8439af8/2022-Subaru-Legacy-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Nissan Altima",
      "description": "Overview\n\nThe Nissan Altima offers an appealing blend of comfort and fuel efficiency. It's also one of the few affordable family sedans to offer all-wheel drive. But competitors outshine it in some areas. The Nissan Altima is a 5-seater vehicle that comes in 5 trim levels. The most popular style is the 2.5 SR FWD, which starts at $27,995 and comes with a 2.5L I4 engine and Front Wheel Drive. This Altima is estimated to deliver 27 MPG in the city and 37 MPG on the highway.\n\nPros\n\nRoomy interior with comfy seats\nExcellent fuel economy\nAvailable all-wheel drive\n\nCons\n\nNot as refined or as sporty as the leaders in this class\nHybrid not available\nOverall Assessment\nIt's been 30 years since Nissan began selling the Altima, its midsize sedan. In that time, the model has found a niche as a consistently well-rounded, and affordable offering in this crowded segment. Slotted between the compact Nissan Sentra and the full-size Nissan Maxima, the handsomely styled Altima boasts a spacious cabin with room for five, a compliant ride, and impressive fuel economy. Those who regularly navigate slippery conditions will also appreciate its available all-wheel-drive powertrain. However, longtime competitors such as the Toyota Camry and the Honda Accord give the Altima a run for its money when it comes to refinement and athleticism. The Altima's base engine can feel sluggish and noisy by comparison. Likewise, its interior materials, especially on the lower trim levels, can feel cheap.",
      "img": "https://static.tcimg.net/vehicles/primary/ff90ae9e72e36284/2022-Nissan-Altima-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2021 Polestar 2",
      "description": "Overview\n\nThe Polestar 2 is a powerful, tech-laden, five-seat hatchback electric vehicle with all-wheel drive and subtle good looks. It is easy to drive and will stand up well against similarly equipped EVs. The Polestar 2 is a 5-seater vehicle that comes in 1 trim levels. The most popular style is the Launch Edition Fastback, which starts at $61,200 and comes with an Electric engine and All Wheel Drive. This 2 is estimated to deliver 96 MPGe in the city and 88 MPGe on the highway.\n\nPros\n\nPowerful\nWell-mannered\nQuiet and comfortable\n\nCons\n\nRange is subpar for the segment\nTight backseat\nLack of interior storage space\n\nOverall Assessment\n\nPolestar, once Volvo's in-house performance arm, is now a stand-alone electric car company within the Volvo Car Group, which in turn is owned by China's Geely Auto. There's a temptation to slot the Polestar 2 into the luxury small-EV class with the likes of the Audi e-tron and Jaguar I-Pace, but it falls short of true luxury car status.\n\nInstead, the all-electric Polestar 2 is a well-appointed, sporty hatchback sedan — Polestar calls it a fastback. It provides scorching acceleration; great handling; loads of high-tech safety; driver-assistance and infotainment features; a comfortable, pleasantly designed interior; and decent cargo capacity. Its safety and driver-assist systems and Google-powered onboard infotainment are top of class. And as a performance car, the Polestar 2 does well even against the most powerful versions of the Tesla Model 3 and Ford Mustang Mach-E. Its biggest drawbacks are its price and range. Even with a $7,500 federal tax credit, the Polestar 2 costs about $1,000 more than a Tesla Model Y Long Range. For that kind of money, it has an unimpressive range.\n",
      "img": "https://static.tcimg.net/vehicles/primary/a2650cea038a1a6c/2021-Polestar-2-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Mercedes-Benz C-Class",
      "description": "Overview\n\nRedesigned for 2022, the Mercedes-Benz C-Class compact luxury sedan delivers a true European driving experience. The Mercedes-Benz C-Class is a 5-seater vehicle that comes in 3 trim levels. The most popular style is the C 300 Sedan 4MATIC, which starts at $46,600 and comes with a 2.0L I4 Turbo engine and All Wheel Drive. This C-Class is estimated to deliver 23 MPG in the city and 33 MPG on the highway.\n\nPros\n\nAttractive exterior design\nLuxurious interior\nImpressive fuel efficiency\n\nCons\n\nOnly the sedan model is updated for 2022\nActive safety features cost extra\nOverall Assessment\nThe all-new 2022 Mercedes-Benz C-Class sedan combines classic Mercedes styling with a design that emphasizes the car's timeless proportions. M-B designers have not bowed to the creased-and-folded craze that has taken hold at some other luxury manufacturers. Though a compact, the C-Class offers good accommodations for up to five adult passengers. Ride quality is a pleasant balance of comfort and handling. The C-Class' turbocharged mild-hybrid engine has virtually the same output as the competitive BMW 330i. It offers more horsepower than the base engine in the Audi A4 and the Cadillac CT4. Among this set, all but the A4 are rear-wheel-drive vehicles with optional all-wheel drive. The C-Class still offers coupe and convertible models, but they are carried over from last year, so they don't yet have the updated styling and features of the sedan.",
      "img": "https://static.tcimg.net/vehicles/primary/af5e272522df4d84/2022-Mercedes-Benz-C-Class-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Mazda Mazda3",
      "description": "Overview\n\nBeautiful interior materials and powerful engine options make the Mazda3 stand out from the competition. The exterior displays elegant, refined styling, but pricing is on the high side for top trims. The Mazda Mazda3 is a 5-seater vehicle that comes in 8 trim levels. The most popular style is the Select Sedan Automatic FWD, which starts at $24,465 and comes with a 2.5L I4 engine and Front Wheel Drive. This Mazda3 is estimated to deliver 26 MPG in the city and 35 MPG on the highway.\n\nPros\n\nHigh-quality interior trims\nExceptional driving dynamics\n\nCons\n\nPriced high for the segment\nInfotainment system is not intuitive\n\nOverall Assessment\n\nThe Mazda Mazda3 is easily one of the most fun compact cars you can drive. There's a choice of sedan or hatchback with a range of three responsive engines. There are all-wheel-drive choices for those who live in more wintry climates. All those possible configurations make it easy to find a version of the Mazda3 that suits your needs. Its sharp handling is paired with a smooth, quiet ride and a comfortable interior that surrounds passengers in high-quality trims. Though Mazda isn't a luxury brand, its top models often push into luxury territory. Our biggest gripe with this fun little car is the infotainment system. It features a rotary controller with no touchscreen; it takes a bit of time to get used to and is a challenge for passengers.\n\nThe Honda Civic has fewer trims and a less upscale interior, but is similarly fun to drive and costs less. The Toyota Corolla nine-trim range includes a hybrid and more affordable pricing. The Subaru Impreza has only four trims with lower pricing but doesn't boast the same smooth ride or elegant interior.\n",
      "img": "https://static.tcimg.net/vehicles/primary/277e9ad7c67cbf65/2022-Mazda-Mazda3-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Cadillac CT4-V",
      "description": "Overview\n\nOne of the best American sport sedans of all time, the fun-to-drive Cadillac CT4-V offers impressive performance, style, and features at an attractive price. The Cadillac CT4-V is a 5-seater vehicle that comes in 2 trim levels. The most popular style is the V-Series Blackwing Manual, which starts at $60,390 and comes with a 3.6L V6 Twin-Turbo engine and Rear Wheel Drive. This CT4-V is estimated to deliver 15 MPG in the city and 23 MPG on the highway.\n\nPros\n\nPowerful turbocharged engines\nExcellent driving dynamics\nMore affordable than some of its German rivals\n\nCons\n\nNot as much power and performance as some key rivals\nAll-wheel drive is not available with the most powerful engine\nTight rear seat space\nOverall Assessment\nThe Cadillac CT4-V is the performance version of the luxury brand's least expensive model, the Cadillac CT4 sedan. V, in Cadillac speak, stands for performance. Think of the brand's V-Series models as the M series from BMW or the AMG line from Mercedes-Benz. As a result, the CT4-V is a driver's sport sedan with more power, better handling, and more aggressive styling than the other CT4 models. While the standard CT4 models compete with the Mercedes-Benz CLA and the BMW 2 Series, the more powerful CT4-V plays against the highly respected Audi S4, Mercedes-AMG C 43, and the BMW M340i. And it stands out in this field of great cars. The turbocharged rear-wheel-drive CT4-V is quick and fun with tight steering and a well-tuned suspension. The 472-horsepower Blackwing model comes standard with a six-speed manual transmission for ultimate driving engagement. The CT4-V is also a good value with one of the lowest prices in its class.",
      "img": "https://static.tcimg.net/vehicles/primary/f3669f24c6d6049c/2022-Cadillac-CT4-V-gray-full_color-driver_side_front_quarter.png"
    }
  ]