[
    {
      "name": "2022 BMW 2 Series",
      "description": "Overview\n\nAn all-new design for the BMW 2 Series coupe gives it a more distinctive look while improving its impressive performance credentials. The carryover 2 Series Gran Coupe four-door remains an acquired taste with its awkward styling. Neither bodystyle provides much room for rear passengers. The BMW 2 Series is a 4-seater vehicle that comes in 4 trim levels. The most popular style is the 230i Coupe RWD, which starts at $37,345 and comes with a 2.0L I4 Turbo engine and Rear Wheel Drive. This 2 Series is estimated to deliver 26 MPG in the city and 35 MPG on the highway.\n\nPros\n\nQuick acceleration\nPremium interior feel\nFuel-efficient engines\n\nCons\n\nSmall back seat\nTwo-door model is no longer offered as a convertible\nOverall Assessment\nThe BMW 2 Series lineup consists of two distinctly different vehicles: the two-door coupe, which is all-new for 2022, and the four-door Gran Coupe which carries forward unchanged from 2021. Both bodystyles are BMW's entry-level models with starting prices in the mid-$30K range. The 2 Series is far from entry-entry level when it comes to performance. The Gran Coupe is the less-powerful sibling, yet even its base 228i model is quick to accelerate and nimble around town. The newly redesigned 2 Series coupe is more powerful and agile than before, so it delivers the feel of a sports car in a handsome package with rear seats that can be used in a pinch. The Gran Coupe has four doors and slightly more room in back, but it too, is tight for rear passengers. All 2 Series models feature premium interiors and solid build quality. The technology interface is an easy-to-use dash-mounted touchscreen. A digital instrument panel is optional along with a head-up display. Most of the design and materials are pulled from the more-expensive BMW 3 Series lineup, so the 2 Series doesn't display any obvious signs of cost cutting. Direct competitors include the Audi A3 and Mercedes-Benz A-Class which have similar price points but are limited to sedan bodystyles only.",
      "img": "https://static.tcimg.net/vehicles/primary/dd90e059238b13d1/2022-BMW-2_Series-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 BMW 4 Series",
      "description": "Overview\n\nNewly redesigned last year, the BMW 4 Series continues to offer the kind of performance, handling, and comfort that's expected from luxury performance vehicles in this price range. The BMW 4 Series is a 4-seater vehicle that comes in 2 trim levels. The most popular style is the M440i Coupe RWD, which starts at $57,695 and comes with a 3.0L I6 Turbo engine and Rear Wheel Drive. This 4 Series is estimated to deliver 25 MPG in the city and 34 MPG on the highway.\n\nPros\n\nExceptional all-around performance\nWide variety of configurations to suit any taste\nLuxurious cabin with high-quality materials throughout\n\nCons\n\nCramped backseat in the coupe and convertible\nBlinding interior brightwork\n\nOverall Assessment\n\nCoupes used to be all the rage. Now only a few thousand deals cross the salesman's desk every year. Already susceptible to hot-then-not fashion fatigue, the BMW 4 Series sells half (or less) the volume of the BMW 3 Series sedan upon which it is based. But there is something cool about the cleaner lines of a coupe — or convertible in this case.\n\nCompeting against the clinical Audi A5, stylish Mercedes-Benz C-Class Coupe, swoopy Lexus RC, and slinky Infiniti Q60, the 4 Series has its work cut out for it. But as the most recently redesigned of the bunch, it has an advantage.\n\nBMW has also reintroduced the 4 Series \"Gran Coupe\" to the lineup, a four-door hatchback sedan with a sloping roofline (read: less headroom for the second-row occupants). Body style aside, every 4 Series offers swift acceleration, powerful brakes, and a supple suspension that makes for an enjoyable ride no matter the route.\n",
      "img": "https://static.tcimg.net/vehicles/primary/c7b960c6cfb04dcb/2021-BMW-4_Series-white-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Subaru BRZ",
      "description": "Overview\n\nThe Subaru BRZ is a small, lightweight, rear-wheel-drive sports car in the classic tradition. With more power, a nicer interior, and refined handling, the redesigned 2022 model is even more fun to drive. The Subaru BRZ is a 4-seater vehicle that comes in 2 trim levels. The most popular style is the Limited Manual, which starts at $31,490 and comes with a 2.4L H4 engine and Rear Wheel Drive. This BRZ is estimated to deliver 20 MPG in the city and 27 MPG on the highway.\n\nPros\n\nExtremely rewarding to drive\nNew engine offers improved power\nStill affordably priced\n\nCons\n\nAdvanced driver-assist features aren't available with the standard manual transmission\nInterior lacks storage space\nAverage fuel economy\nOverall Assessment\nA small, affordable, rear-wheel-drive sports car, the Subaru BRZ is an outlier from a brand best known for all-wheel-drive crossovers and SUVs. Introduced for 2013, the BRZ is co-developed with Toyota, which sells a nearly identical version called the Toyota GR86. Both are built by Subaru, utilize a Subaru boxer engine, and have been treated to their first major redesign for 2022. In addition to BRZ's new, more curvaceous look, the 2+2 sport coupe gets a larger and more powerful engine, a nicer interior, and a new infotainment system. The BRZ is a blast to drive, with sharp handling and a standard six-speed stick shift (an automatic is available). Unlike its Mazda MX-5 Miata rival, the BRZ has a small back seat to provide a measure of practicality.",
      "img": "https://static.tcimg.net/vehicles/primary/522d6a2c48add136/2022-Subaru-BRZ-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Toyota GR86",
      "description": "Overview\n\nThe new Toyota GR86 is a performance coupe for those who want an aggressive, exhilarating drive with sharp handling and sleek styling. The four-passenger coupe has snug rear seats, but that doesn't diminish the fun of this affordable sports car. The Toyota GR86 is a 4-seater vehicle that comes in 2 trim levels. The most popular style is the Premium Automatic, which starts at $32,825 and comes with a 2.4L H4 engine and Rear Wheel Drive. This GR86 is estimated to deliver 21 MPG in the city and 31 MPG on the highway.\n\nPros\n\nMore powerful engine\nCrisp handling\nNicely trimmed interior\n\nCons\n\nStiff ride\nTight rear seats\n\nOverall Assessment\n\nThe Toyota GR86 marks the return of the Toyota 86 after a one-year hiatus. The second-generation performance coupe promises more thrills thanks to increased power, improved handling, and an upgraded interior. It delivers a true sports-car experience with aggressive acceleration, but its tuned suspension can make for a harsh ride. There's room for four passengers, but the rear seats are very snug — unusable for all but the shortest trips. The new interior is significantly upgraded with better materials and a clean, modern look. A large infotainment screen and smartphone connectivity are part of the GR86's standard equipment, along with plenty of safety features.\n\nThere are few direct competitors to the Toyota GR86. The Mazda MX-5 Miata convertible is more expensive, has less horsepower, and no rear seats, but it offers a more comfortable ride. The Volkswagen Golf GTI has comparable horsepower and a spacious interior with roomy rear seats but a more conservative exterior style.\n",
      "img": "https://static.tcimg.net/vehicles/primary/a73900ccbcd27edb/2022-Toyota-GR86-white-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Audi A5",
      "description": "Overview\n\nThree stunning shapes — coupe, convertible, and hatchback — combined with sharp handling and advanced tech make the Audi A5 one of today's best compact sports cars. The Audi A5 is a 4-seater vehicle that comes in 3 trim levels. The most popular style is the S line Prestige Coupe 45 TFSI, which starts at $56,545 and comes with a 2.0L I4 Turbo engine and All Wheel Drive. This A5 is estimated to deliver 24 MPG in the city and 31 MPG on the highway.\n\nPros\n\nSporty handling and performance, boosted by standard all-wheel drive\nPremium interior materials\nThree body styles to suit most lifestyles\n\nCons\n\nSome competitors offer more rear passenger room\nScant cargo space in coupe and convertible models\nHefty premium for optional safety features\n\nOverall Assessment\n\nWith high-riding SUVs all the rage these days, Audi is one of the few automakers still in the coupe and convertible game. The 2022 Audi A5 blends the brand's trademarks — style, all-wheel-drive handling, technology — into stunning coupe, convertible, and four-door \"coupe\" shapes. Impeccable cabin design and materials infuse the interior with a luxury feel. Tech and infotainment are rich and full-featured, and while power is modest, the way the A5 slices through turns is joyous.\n\nFor 2022, the A5 adds a handful of upgrades. Android Auto, like Apple CarPlay, is now wireless, freeing the center console of cable spaghetti. A now-standard sport suspension sharpens handling for the coupe and Sportback hatch models. The popular Black Optic Plus appearance package is now available for the base Sportback.\n\nAudi isn't the only brand still bullish on coupes and convertibles, of course. Safe to say that if rivals such as BMW, Mercedes-Benz, and Lexus were not also still invested in two-doors and droptops, Audi's boardroom discussions might find renewed focus. But for now, the A5 remains one of the most refreshing alternatives to boxy sedans, sleepy SUVs, and Jeep-y safari cars.\n",
      "img": "https://static.tcimg.net/vehicles/primary/d065788665f0f2de/2022-Audi-A5-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Lexus LC",
      "description": "Overview\n\nSold in coupe and convertible body styles, the Lexus LC's deluxe cabin and sleek exterior styling make it a standout among luxury sports cars. However, it's not as practical as some rivals due to limited cargo space and tight rear-seat legroom. The Lexus LC is a 4-seater vehicle that comes in 2 trim levels. The most popular style is the LC 500h Coupe, which starts at $100,125 and comes with a Hybrid 3.5L V6 engine and Rear Wheel Drive. This LC is estimated to deliver 26 MPG in the city and 34 MPG on the highway.\n\nPros\n\nHead-turning design\nExquisitely crafted cabin\nImpressive fuel economy from the available hybrid\n\nCons\n\nLow on cargo space\nCramped rear seat\nRival models deliver sportier handling\n\nOverall Assessment\n\nLuxury sports cars balance opulence with performance, and the Lexus LC is a desirable pick in this segment. Dressed in the finest materials, its cabin is as plush as it gets. And its potent, standard V8 (a fuel-efficient hybrid powertrain is also offered) is a good match for the car's smooth handling and refined road manners.\n\nOn a less positive note, the Lexus LC isn't exactly brimming with utility. Other picks in this class have much more room for cargo; for example, the BMW 8 Series has more than twice as much cargo space as the LC. And if you're looking for a car that emphasizes athleticism, rival models like the Jaguar F-Type are more track-focused and spirited. Still, the swanky LC is a top choice if you need a high-end sports car that emphasizes style, luxury, and comfort.\n",
      "img": "https://static.tcimg.net/vehicles/primary/ab9b3cbc095de22f/2022-Lexus-LC-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 INFINITI Q60",
      "description": "Overview\n\nThe Infiniti Q60 is a luxury sport coupe with a smooth ride, powerful engines, and a beautiful interior. However, the rear seats are cramped, and advanced safety features aren't available on all models. The INFINITI Q60 is a 4-seater vehicle that comes in 3 trim levels. The most popular style is the LUXE RWD, which starts at $51,325 and comes with a 3.0L V6 Twin-Turbo engine and Rear Wheel Drive. This Q60 is estimated to deliver 19 MPG in the city and 28 MPG on the highway.\n\nPros\n\nAvailable all-wheel drive\nSmooth ride\nLuxurious interior\n\nCons\n\nMinimal standard safety features\nTight rear seats\nTricky infotainment controls\n\nOverall Assessment\n\nThe Infiniti Q60 is a sleek, sporty luxury coupe with seating for up to four people, though the rear seats are tight. Here the performance of a sports car is combined with the style of a luxury sedan for a thoroughly engaging ride. Two powerful engines are offered along with standard rear-wheel drive. All-wheel drive is optional across the lineup. It boasts an attractive and luxurious interior with a smooth, well-mannered ride, even in the high-performance Red Sport 400 trim. The infotainment, which gets standard wireless Apple CarPlay this year, has a dual-screen layout that can be a bit tricky, but all the right features are included. Safety features are lacking on the base trim but are optional or standard as you move up the lineup.\n\nCompetitors include the Audi A5, which has a similarly well-appointed interior but a less powerful engine. The Mercedes-Benz C-Class offers a higher level of luxury with more performance in its top trims. The BMW 4 Series has a wide range of configurations that include a convertible, all with powerful engines and luxurious interiors.\n",
      "img": "https://static.tcimg.net/vehicles/primary/1786834d259ee9a8/2022-INFINITI-Q60-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Toyota GR Supra",
      "description": "Overview\n\nThe Toyota GR Supra is a sporty two-seater with a choice of powerful engines and precise handling. Purists will find fault with its lack of a manual transmission option, but in every other respect, the Supra delivers a true sports car experience. The Toyota GR Supra is a 2-seater vehicle that comes in 4 trim levels. The most popular style is the 3.0 Premium, which starts at $56,065 and comes with a 3.0L I6 Turbo engine and Rear Wheel Drive. This GR Supra is estimated to deliver 22 MPG in the city and 30 MPG on the highway.\n\nPros\n\nBrisk acceleration with either engine\nSporty handling without a harsh ride\nInterior looks and feels expensive\n\nCons\n\nTight seating\nNo manual transmission offered\n\nOverall Assessment\n\nThe Toyota GR Supra is a stylish sports car with two powerful engine options and a range of four well-equipped trims. It's a pleasure to drive down a winding country road and equally well-suited to an afternoon of spirited track driving. No matter which engine you choose, there's strong acceleration with responsive handling. This is a purebred sports car designed for people who enjoy driving. As a two-seater, it's best for singles or couples who don't need seating for kids. The GR Supra balances its sportiness with a smooth ride that's not overly harsh. You'll feel broken pavement, but it won't rattle your teeth. The interior is comfortable yet snug. Those on the tall side won't have much room — there's just enough space for 6-footers. Good standard safety tech and a fully-featured infotainment system round out the package. It's more affordable than competitors, making it easier to fit into modest budgets.\n\nThe Subaru BRZ offers the same sporty handling as the GR Supra but with less horsepower and a lower price. The BMW Z4 has the same engines but with a more luxurious interior and higher starting price. The Mazda MX-5 Miata offers the fun of a convertible with a lower price and more modest horsepower.\n",
      "img": "https://static.tcimg.net/vehicles/primary/c9e697d365873099/2022-Toyota-GR_Supra-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Mercedes-Benz E-Class",
      "description": "Overview\n\nThe 2022 Mercedes-Benz E-Class has an enticing exterior design, impressive interior style, and a stunning level of technological excellence. Some of the tech is hard to use, and the options list gets confusing, yet we still consider it one of the best luxury vehicles in its class. The Mercedes-Benz E-Class is a 4-seater vehicle that comes in 3 trim levels. The most popular style is the E 450 Coupe RWD, which starts at $67,150 and comes with a 3.0L I6 Turbo engine and Rear Wheel Drive. This E-Class is estimated to deliver 22 MPG in the city and 29 MPG on the highway.\n\nPros\n\nExcellent build quality\nBeautifully detailed cabin\nStrong yet efficient engines\n\nCons\n\nComplex infotainment system\nLong list of options makes it hard to configure\n\nOverall Assessment\n\nThe Mercedes-Benz E-Class is one of the vaunted brand's most versatile vehicles. Each vehicle in the E-Class lineup sets a high standard of excellence by which competitive cars are judged. The E-Class balances leading-edge technology with traditional automotive luxury in a manner that others find difficult to counter. And it does so in sedan, coupe, and wagon body styles that give it a level of flexibility that's rare in the class. All the E-Class variants share common attributes that include classic luxury, innovative technology, rock-solid build quality, and impressive safety. Its rear-drive layout enables the sedan to provide better handling than a front-drive car. While the standard E-Class models offer plenty of driving pleasure, the sport-oriented AMG versions take the driving experience to a higher level.\n\nThe E-Class sedan is in the middle of its competitive set in terms of size. It is 1.5 inches shorter than the BMW 5 Series and on par with the Audi A6. The Cadillac CT5 — the only domestic luxury sedan that competes with the E-Class — is half an inch shorter. The visually stunning E-Class coupe is 4 inches shorter than the sedan.\n",
      "img": "https://static.tcimg.net/vehicles/primary/93b9ac65206851ad/2022-Mercedes-Benz-E-Class-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Ford Mustang",
      "description": "Overview\n\nThe Ford Mustang still clings to its original formula: a highly styled two-door that puts racing looks and performance ahead of everyday practicality. Among current performance cars, the iconic Mustang is a bargain. The Ford Mustang is a 4-seater vehicle that comes in 6 trim levels. The most popular style is the GT Premium Fastback, which starts at $43,960 and comes with a 5.0L V8 engine and Rear Wheel Drive. This Mustang is estimated to deliver 15 MPG in the city and 24 MPG on the highway.\n\nPros\n\nWide model range offers a Mustang for every type of buyer\nComfortable front seats\nAvailable as a coupe or convertible\n\nCons\n\nV8s are thirsty for fuel\nSmall backseat\n\nOverall Assessment\n\nMore than 60 years ago, the Ford Mustang was created with a magic formula that has served it well. It's always been a front-engine, rear-wheel-drive two-door with sporty bucket seats and a small backseat. With a long hood and short rear deck, the Mustang looks powerful and sporty, even in base-level trims. Ford has recently dropped most of its car line, leaving just the Mustang and specialty Ford GT among a host of SUVs and pickup trucks.\n\nFor 2022, Ford is bypassing major changes to the Mustang in favor of freshening the lineup with five new special-edition models. The Mustang is one of those rare vehicles that can justify a very wide price spread. A basic Mustang EcoBoost Fastback has a starting price of just over $28,000, while the Shelby GT500 has a base price of more than $70,000. Options can push that price to about $100,000.\n\nIn this era of crossover dominance, the Mustang has only two head-to-head competitors. The Chevrolet Camaro is most similar to the Mustang, and versions of both compete in NASCAR. The Dodge Challenger has a similar vibe but is larger than the Ford. In overall length, the Mustang is the same size as the Camaro but almost 10 inches shorter than the Challenger. The Mustang and Camaro are available in coupe and convertible versions, while the Challenger is only offered as a coupe.\n",
      "img": "https://static.tcimg.net/vehicles/primary/556cd2e1e0c1647d/2022-Ford-Mustang-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Chevrolet Camaro",
      "description": "Overview\n\nThe Chevrolet Camaro is a legendary muscle car that survives as Chevrolet turns its emphasis to trucks and SUVs. Exhilarating performance, striking styling, and modern technology make the big coupe fun to drive. But it is less enjoyable for daily errands thanks to its small cabin and tiny trunk. The Chevrolet Camaro is a 4-seater vehicle that comes in 8 trim levels. The most popular style is the Coupe LT1, which starts at $35,395 and comes with a 6.2L V8 engine and Rear Wheel Drive. This Camaro is estimated to deliver 16 MPG in the city and 24 MPG on the highway.\n\nPros\n\nDistinctive exterior styling\nExcellent infotainment system\nImpressive performance\n\nCons\n\nTight interior\nMiniscule trunk\nElectronic driver aids limited to upper trims\n\nOverall Assessment\n\nAvailable as a two-door coupe or two-door convertible, the 2022 Chevrolet Camaro is the latest edition of a model that dates back to the halcyon days of the 1960s. Not only was Flower Power all the rage, but sporty youth-oriented cars such as the Camaro were taking the market by storm. The Ford Mustang started the craze, but the Chevy Camaro was a fast follower and gave the Mustang a run for its money. Fifty years later, the American car market has changed, but the basic Camaro concept remains. The car is still a high-style rear-drive two-door that delivers sporty performance. Further, it is available in several variations — not only convertible and coupe but also with a bevy of engine choices.\n\nThe bedrock engine for the Camaro remains a big-displacement V8. Space efficiency was never one of the Camaro's strong suits, and that remains so today. The vehicle is a classic \"2+2\" designed to provide excellent accommodations for driver and front-seat passenger with rear seats that can hold two others in a pinch. The Camaro offers a large portion of driving fun even in its least performance-oriented trim. And at the top of the lineup, it provides performance only a handful of cars can match.\n\nIn terms of size, the Chevy Camaro and the Mustang are identical. The Camaro's other direct competitor is the Dodge Challenger, another highly styled two-door coupe. But the Challenger is almost 10 inches longer than the Camaro and offers a much more usable rear seat.\n",
      "img": "https://static.tcimg.net/vehicles/primary/372ff4e1e2c48b46/2022-Chevrolet-Camaro-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2023 BMW 8 Series",
      "description": "Overview\n\nDistinctive styling, a decadent interior, and thrilling performance make the BMW 8 Series a worthy flagship model for the German luxury brand. Tight rear seats and a steep price tag are the only reasons to hesitate if you're in the market for a high-end coupe, convertible, or sporty sedan. The BMW 8 Series is a 4-seater vehicle that comes in 3 trim levels. The most popular style is the M850i Coupe xDrive, which starts at $103,495 and comes with a 4.4L V8 Turbo engine and All Wheel Drive. This 8 Series is estimated to deliver 17 MPG in the city and 24 MPG on the highway.\n\nPros\n\nCabin looks and feels expensive\nStrong, smooth performance from either engine option\nRefined ride makes it comfortable for daily driving or long road trips\n\nCons\n\nMore expensive than some direct rivals\nSome safety features are optional\nRear seats in coupe and convertible aren't big enough for adult passengers\nOverall Assessment\nSitting at the top of the BMW lineup alongside the more traditional 7 Series sedan, the BMW 8 Series is a sportier take on top-end luxury and performance. Available as a two-door coupe, convertible, or low-roofed four-door sedan, the 8 Series has sensational performance to back up its exotic looks. From the base 840i to the top-end Alpina B8, the 8 Series is the kind of car that makes any trip feel special. Powerful engines assure pulse-quickening acceleration while the unflappable suspension smoothes out any type of road imperfections. A decadent interior completes the package as the cabin of the 8 Series is a step above the average luxury car. From the sleek design to the feel of the materials, every element of the 8 Series looks expensive. The only obvious flaw to the 8 Series is its size, as the rear seats in the coupe and convertible models are too small for adults. Even the four-door Gran Coupe model is tight in the back for taller passengers. It's a similar story when it comes to competitors such as the Mercedes-Benz SL, Mercedes-Benz CLS, and Audi S7, all of which sacrifice passenger comfort in the name of style.",
      "img": "https://static.tcimg.net/vehicles/primary/64f408a11168f7e9/2023-BMW-8_Series-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2023 BMW M8",
      "description": "Overview\n\nThe BMW M8 offers spirited performance, luxurious accommodations, and body styles for varying tastes. However, its stiff ride quality makes it a less-than-ideal choice for daily commutes. The BMW M8 is a 4-seater vehicle that comes in 1 trim levels. The most popular style is the Competition Coupe, which starts at $135,095 and comes with a 4.4L V8 Turbo engine and All Wheel Drive. This M8 is estimated to deliver 15 MPG in the city and 22 MPG on the highway.\n\nPros\n\nQuick acceleration\nAthletic handling\nDifferent body styles\n\nCons\n\nTight rear-seat legroom in coupe and convertible models\nStiff ride\nRival models have more horsepower\n\nOverall Assessment\n\nThe BMW M8 is a luxury sports car that gives you your pick of body styles. It's available as a coupe or a two-door convertible. And unlike its Audi R8 and Porsche 911 rivals, the M8 also comes in a relatively roomy four-door version. Regardless of which body style you choose, you'll enjoy a car with plush accommodations, sharp reflexes, and quick acceleration.\n\nIn the deficit column, the second-row legroom is cramped if you choose the coupe or convertible. And the trade-off for this BMW's sporty handling is a stiff ride quality that can be an annoyance in everyday driving. But overall, the M8 excels as a sports car that's agile and luxurious.\n",
      "img": "https://static.tcimg.net/vehicles/primary/3e7550c45cc2b1ba/2023-BMW-M8-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Mercedes-Benz C-Class",
      "description": "Overview\n\nRedesigned for 2022, the Mercedes-Benz C-Class compact luxury sedan delivers a true European driving experience. The Mercedes-Benz C-Class is a 4-seater vehicle that comes in 3 trim levels. The most popular style is the C 300 Coupe RWD, which starts at $48,900 and comes with a 2.0L I4 Turbo engine and Rear Wheel Drive. This C-Class is estimated to deliver 22 MPG in the city and 31 MPG on the highway.\n\nPros\n\nAttractive exterior design\nLuxurious interior\nImpressive fuel efficiency\n\nCons\n\nOnly the sedan model is updated for 2022\nActive safety features cost extra\nOverall Assessment\nThe all-new 2022 Mercedes-Benz C-Class sedan combines classic Mercedes styling with a design that emphasizes the car's timeless proportions. M-B designers have not bowed to the creased-and-folded craze that has taken hold at some other luxury manufacturers. Though a compact, the C-Class offers good accommodations for up to five adult passengers. Ride quality is a pleasant balance of comfort and handling. The C-Class' turbocharged mild-hybrid engine has virtually the same output as the competitive BMW 330i. It offers more horsepower than the base engine in the Audi A4 and the Cadillac CT4. Among this set, all but the A4 are rear-wheel-drive vehicles with optional all-wheel drive. The C-Class still offers coupe and convertible models, but they are carried over from last year, so they don't yet have the updated styling and features of the sedan.",
      "img": "https://static.tcimg.net/vehicles/primary/ba52c980d8ed070a/2022-Mercedes-Benz-C-Class-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Lexus RC",
      "description": "Overview\n\nThe Lexus RC impresses with its exquisite cabin and smooth handling. However, its cramped rear seat and tiny trunk make it a poor choice if you need a car with some utility. The Lexus RC is a 4-seater vehicle that comes in 6 trim levels. The most popular style is the RC 350 AWD, which starts at $48,990 and comes with a 3.5L V6 engine and All Wheel Drive. This RC is estimated to deliver 19 MPG in the city and 26 MPG on the highway.\n\nPros\n\nQuiet cabin\nBeautiful interior\nSmooth, refined handling\n\nCons\n\nLimited cargo capacity\nSmall rear seat\nLess sporty than some rivals\n\nOverall Assessment\n\nThe Lexus RC is one of the most eye-catching compact luxury cars on the market, brimming with high-end style both inside and out. It provides refined driving dynamics and superior comfort.\n\nFor a more visceral driving experience, consider the sportier Genesis G70. And for the utility that comes with a bigger trunk and roomier rear seat, choose the Audi A4. Still, the RC is a standout if you appreciate impeccable craftsmanship and smooth performance.\n",
      "img": "https://static.tcimg.net/vehicles/primary/524879e226a24626/2022-Lexus-RC-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Porsche 911",
      "description": "Overview\n\nWith its celebrated heritage, iconic design, and unmatched driving experience, the Porsche 911 is a sports car that can be enjoyed every day. Plus, it's still a bargain relative to other high-performance luxury cars. The Porsche 911 is a 4-seater vehicle that comes in 12 trim levels. The most popular style is the Carrera S Coupe RWD, which starts at $118,450 and comes with a 3.0L H6 Twin-Turbo engine and Rear Wheel Drive. This 911 is estimated to deliver 18 MPG in the city and 23 MPG on the highway.\n\nPros\n\nIconic style and performance\nSpectacular driving experience\nExpansive lineup of available body styles and powerful engines\n\nCons\n\nInsufficient interior storage\nShort list of standard features\nOverall Assessment\nWhen you think Porsche, you think Porsche 911. For many, it has been the quintessential sports car since the 1960s. It continues to lead the industry with a unique combination of breathtaking performance, civility, and comfort that can be enjoyed every day, in all four seasons. Offered in 12 variations spread across three body styles — coupe, convertible, and Targa — there's a 911 to suit your desired level of performance with horsepower ranging from 379 to 640. Rear-wheel-drive and all-wheel-drive models are also available, and Porsche still offers some variants with a clutch pedal and an excellent seven-speed manual transmission. Most, however, are sold with Porsche's PDK automatic, which is considered the best dual-clutch gearbox available. Its desirability continues with its iconic design, modern interior, exceptional build quality, and back seat. Rivals include the supercars from McLaren, Ferrari, and Lamborghini, the Mercedes-Benz AMG GT, Audi R8, and grand tourers such as the BMW M8.",
      "img": "https://static.tcimg.net/vehicles/primary/9dae3ab12fe71fbe/2022-Porsche-911-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Audi TTS",
      "description": "Overview\n\nThe Audi TTS is a small luxury sport coupe that's fun to drive and relatively fuel-efficient. However, it doesn't provide much utility, and rival models have more power. The Audi TTS is a 4-seater vehicle that comes in 1 trim levels. The most popular style is the 2.0 TFSI quattro, which starts at $61,295 and comes with a 2.0L I4 Turbo engine and All Wheel Drive. This TTS is estimated to deliver 23 MPG in the city and 31 MPG on the highway.\n\nPros\n\nChic, modern cabin\nEnjoyable handling\nMore fuel-efficient than many rivals\n\nCons\n\nLess powerful than many competitors\nLow on cargo space\nTight rear seat\n\nOverall Assessment\n\nThe Audi TT is a sports car beloved for its stylish, good looks and mellow personality, and it has a couple of high-performance variants: the Audi TTS and the Audi TT RS. Of the two, the TTS is less potent, but it's more affordable. Thus, it hits the right note for drivers who want a souped-up version of the TT that won't break the bank.\n\nIn the deficit column, Audi's TTS has less power than rivals such as the Porsche 718 Cayman. And don't even think about an adult riding in its tiny rear seat. But if those shortcomings aren't deal-breakers, you'll find the TTS capably equipped to add style and pleasure to daily driving.\n",
      "img": "https://static.tcimg.net/vehicles/primary/e2fb2861599b79bc/2022-Audi-TTS-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2023 Chevrolet Corvette",
      "description": "Overview\n\nThe Chevrolet Corvette has evolved over 70 years to become America's premier sports car with its mid-engine design and motorsport technology at a fraction of the cost of European rivals. The Corvette holds onto its heritage with the classic sounds of its V8, and power is still sent to the rear wheels. Chevrolet has improved its capacity as a daily driver with a luxurious cabin and modern interior features. The Chevrolet Corvette is a 2-seater vehicle that comes in 3 trim levels. The most popular style is the Stingray 1LT Coupe, which starts at $65,595 and comes with a 6.2L V8 engine and Rear Wheel Drive. This Corvette is estimated to deliver 16 MPG in the city and 24 MPG on the highway.\n\nPros\n\nOutsized performance. Comfortable daily driver. Race-inspired technology. Outruns far more expensive cars.\n\nCons\n\nNo manual transmission. Low-grade interior plastics. Few driver safety assists.\nOverall Assessment\nThe Chevrolet Corvette is one of the sports car values of the century, offering the acceleration, handling, and braking one would expect in a car costing twice as much. The secret to its success is a redesigned chassis and mid-engine layout. The Corvette is pleasant enough to drive that it can be used daily, with a spacious cabin and pliant ride. The Corvette's weaknesses are few, but they exist–there could be more driver-assistance aids, and Chevrolet does not offer a manual transmission. Criticisms aside, the Corvette is the rare car that delivers monumental performance, stunning good looks, and surprising practicality and value.",
      "img": "https://static.tcimg.net/vehicles/primary/0ffb49bdc8597147/2023-Chevrolet-Corvette-gray-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Audi R8",
      "description": "Overview\n\nThe 2022 Audi R8 offers an intoxicating mix of supercar performance, sheer power, and eye-catching design combined with daily civility. It's a great choice for drivers who want to enjoy their supercar every day of the week. The Audi R8 is a 2-seater vehicle that comes in 2 trim levels. The most popular style is the V10 Coupe RWD, which starts at $150,195 and comes with a 5.2L V10 engine and Rear Wheel Drive. This R8 is estimated to deliver 14 MPG in the city and 23 MPG on the highway.\n\nPros\n\nSupercar looks and speed\nAll-wheel-drive security\nComfortable enough for everyday driving\n\nCons\n\nMinimal cargo space\nDoesn't deliver the power and handling of some rivals\nOverall Assessment\nA six-figure two-seat mid-engine supercar with over 600 horsepower, the Audi R8 lives at the top of the Audi food chain. Supercars are all about sex appeal and speed, and the R8 delivers, rocketing from zero to60 mph in 3.6 seconds or less. It's thrilling to drive, and unlike some of its rivals, it's available with all-wheel drive. That adds some security to its handling, especially on wet roads. The R8, which is available as a two-seat coupe or convertible, is also civilized enough to drive daily thanks to a surprisingly roomy interior and brilliantly tuned suspension that provides a refined ride quality. Given the current state of high-performance car prices, the Audi R8 is also a bargain. Many rivals — such as the McLaren GT, Lamborghini Huracan Evo, and Ferrari F8 Tributo — cost considerably more. Even the Porsche 911 Turbo and Acura NSX Type S have higher base prices. The Chevrolet Corvette has the lowest horsepower rating and price of the pack.",
      "img": "https://static.tcimg.net/vehicles/primary/a0699eeb53056e3f/2022-Audi-R8-silver-full_color-driver_side_front_quarter.png"
    },
    {
      "name": "2022 Maserati MC20",
      "description": "Overview\n\nThe Maserati MC20 is a 2-seater vehicle that comes in 1 trim levels. The most popular style is the Coupe, which starts at $215,995 and comes with a 3.0L V6 Turbo engine and Rear Wheel Drive. This MC20 is estimated to deliver 15 MPG in the city and 25 MPG on the highway.\n",
      "img": "https://static.tcimg.net/vehicles/primary/33be212bf049fab9/2022-Maserati-MC20-gray-full_color-driver_side_front_quarter.png"
    }
  ]